from flask import Flask, render_template, request, session

app = Flask(__name__)
app.secret_key = "kN0<@K0}dG3{s>9B@7nCs/=;UyQ"

# topic.htmlと連動
topics = [
    ["りんご", "みかん"],
    ["犬", "猫"],
    ["学校", "図書館"],
    ["電車", "バス"],
    ["ピザ", "ハンバーガー"],
    ["海", "川"],
    ["サッカー", "バスケ"],
    ["春", "秋"],
    ["コーヒー", "紅茶"],
    ["車", "バイク"],
    ["パン", "ご飯"],
    ["ピアノ", "ギター"],
    ["スイカ", "メロン"],
    ["ねこ", "ねずみ"],
    ["犬小屋", "猫ハウス"],
    ["鉛筆", "ペン"],
    ["リンゴジュース", "オレンジジュース"],
    ["自転車", "キックボード"],
    ["映画館", "カラオケ"],
    ["タクシー", "電車"],
    ["チョコレート", "キャンディ"],
    ["砂浜", "山"],
    ["春巻き", "餃子"],
    ["テレビ", "ラジオ"],
    ["ケーキ", "クッキー"],
    ["トマト", "きゅうり"],
    ["橋", "トンネル"],
    ["机", "椅子"],
    ["パソコン", "スマホ"],
    ["山登り", "ハイキング"],
    ["ビール", "ワイン"],
    ["ネクタイ", "スカーフ"],
    ["かばん", "リュック"],
    ["青空", "夕焼け"],
    ["雨", "雪"],
    ["時計", "カレンダー"],
    ["飛行機", "船"],
    ["サングラス", "メガネ"],
    ["筆箱", "教科書"],
    ["犬の散歩", "猫の餌やり"],
    ["バナナ", "オレンジ"],
    ["ラーメン", "うどん"],
    ["自動販売機", "コンビニ"],
    ["寿司", "刺身"],
    ["公園", "遊園地"],
    ["映画", "ドラマ"],
    ["アイスクリーム", "シャーベット"],
    ["新幹線", "飛行機"],
    ["温泉", "銭湯"],
    ["野球", "テニス"],
    ["カレー", "シチュー"],
    ["花火", "イルミネーション"],
    ["スマートウォッチ", "腕時計"],
    ["スキー", "スノーボード"],
    ["教室", "職員室"],
    ["ベッド", "布団"],
    ["シャツ", "セーター"],
    ["プリン", "ゼリー"],
    ["ビーチ", "プール"],
    ["山", "丘"],
    ["マウス", "キーボード"],
    ["カメラ", "ビデオカメラ"],
    ["本屋", "図書館カード"],
    ["ケチャップ", "マヨネーズ"],
    ["ハサミ", "カッター"],
    ["プリンタ", "コピー機"],
    ["スリッパ", "靴"],
    ["電気", "ろうそく"],
    ["スマホケース", "パソコンカバー"],
    ["駅", "空港"],
    ["レモン", "ライム"],
    ["牛乳", "豆乳"],
    ["ソファ", "ベッド"],
    ["白ごはん", "チャーハン"],
    ["ホットケーキ", "ワッフル"],
    ["冷蔵庫", "電子レンジ"],
    ["魚", "肉"],
    ["サンドイッチ", "ハンバーガー"],
    ["風", "嵐"],
    ["ロボット掃除機", "掃除機"],
    ["帽子", "ヘルメット"],
    ["音楽", "演劇"],
    ["ペットボトル", "缶"],
    ["エレベーター", "エスカレーター"],
    ["バス停", "駅前"],
    ["プリクラ", "写真館"],
    ["スピーカー", "イヤホン"],
    ["メロンパン", "クロワッサン"],
    ["牛丼", "親子丼"],
    ["新聞", "雑誌"],
    ["花", "観葉植物"],
    ["鉛筆削り", "消しゴム"],
    ["国語", "算数"],
    ["地図", "カーナビ"],
    ["カラーペン", "色鉛筆"],
    ["夜空", "星空"],
    ["タオル", "ハンカチ"],
    ["サラダ", "スープ"],
    ["バレーボール", "ハンドボール"],
    ["雪だるま", "かまくら"],
    ["飛行場", "港"],
    ["冷房", "暖房"],
    ["朝ごはん", "昼ごはん"],
    ["定規", "コンパス"],
    ["自動車学校", "塾"],
    ["果物", "野菜"],
    ["卵焼き", "目玉焼き"],
    ["うさぎ", "ハムスター"],
    ["パン屋", "ケーキ屋"],
    ["タブレット", "ノートパソコン"],
    ["メール", "手紙"],
    ["スーツ", "作業着"],
    ["電卓", "そろばん"],
    ["ブランコ", "すべり台"],
    ["牛", "馬"],
    ["月", "太陽"],
    ["焼き鳥", "唐揚げ"],
    ["線路", "道路"],
    ["電球", "蛍光灯"],
    ["花瓶", "植木鉢"],
    ["カーテン", "ブラインド"],
    ["シャンプー", "リンス"],
    ["トランプ", "UNO"],
    ["辞書", "百科事典"],
    ["ラップ", "アルミホイル"],
    ["ポスト", "宅配ボックス"],
    ["カレンダーアプリ", "手帳"],
    ["タブレット菓子", "ガム"],
    ["星座", "惑星"],
    ["ハンバーグ", "ステーキ"],
    ["地球儀", "地図帳"],
    ["折り紙", "画用紙"],
    ["動物園", "水族館"],
    ["花束", "ブーケ"],
    ["自販機", "ATM"],
    ["洗濯機", "乾燥機"],
    ["スマホゲーム", "ボードゲーム"],
    ["包丁", "まな板"],
    ["おにぎり", "太巻き"],
    ["手袋", "軍手"],
    ["お城", "神社"],
    ["サンドバッグ", "ダンベル"]
]

# 名前入力画面
@app.route("/")
def index():
    session.clear()
    return render_template("index.html")

# お題表示画面
@app.route("/topic")
def topic():
    return render_template("topic.html")

# ゲーム画面
@app.route("/game")
def game():
    index, topic_index = request.args.get("member_index"), int(request.args.get("topic_index"))
    session["index"], session["normal_topic"], session["wolf_topic"] = index, topics[topic_index][0], topics[topic_index][1]
    return render_template("game.html")

# 名前処理
@app.route("/member", methods=["POST"])
def member():
    members = request.form.getlist("name")
    session["members"] = members
    return render_template("topic.html", members=members)

# 投票画面
@app.route("/result")
def vote():
    index = int(session.get("index"))
    who_wolf = session.get("members")[index]
    normal, wolf = session.get("normal_topic"), session.get("wolf_topic")
    return render_template("result.html", who_wolf=who_wolf, normal=normal, wolf=wolf)

@app.route("/study")
def study():
    return render_template("study.html")

if __name__ == "__main__":
    app.run(debug=True)
